
/*
本文件由工具自动生成 请勿手动修改！！！
*/

using System;
using System.Collections.Generic;

namespace ServerBase.Protocol
{
    [Desc("返回码")]
    public enum EProtocolResult
    {
        成功 = 0,
        失败 = 1,
        异常 = 2,
        服务器异常 = 10,
        服务器数据库异常 = 11,
        服务器配置文件异常 = 12,
        游戏服务器未开启 = 13,
        平台数据库异常 = 14,
        平台账号不存在 = 15,
        服务器拥挤 = 16,
        服务器维护中 = 17,
        登陆受限 = 18,
        账号被封禁 = 19,
        游戏版本不一致 = 20,
        服务器数据计算中 = 21,
        管理员登陆账号错误 = 50,
        管理员登陆密码错误 = 51,
        管理员登陆账号已在线 = 52,
        玩家不存在 = 53,
        发送邮件失败 = 54,
        玩家不在线 = 55,
        修改数据失败 = 56,
        调试指令错误 = 57,
        玩家已经被注册 = 70,
        账号不存在 = 71,
        密码错误 = 72,
        验证错误请重新登陆 = 73,
        无玩家数据请创建角色 = 74,
        名字已经被使用 = 75,
        账号长度不符 = 76,
        密码长度不符 = 77,
        名字长度不符 = 78,
        名字长度太短 = 79,
        名字长度太长 = 80,
        名字含有不合法或者不雅字符 = 81,
        类型错误 = 82,
        文本为空 = 83,
        文本太长 = 84,
        数据为空 = 85,
        图片数据太大 = 86,
        语音数据太大 = 87,
        列表为空 = 88,
        ID错误 = 100,
        配置ID错误 = 101,
        对象ID错误 = 102,
        府ID错误 = 103,
        数量不合法 = 110,
        数据类型错误 = 111,
        等级不足 = 112,
        体力不足 = 113,
        元宝不足 = 114,
        金币不足 = 115,
        银两不足 = 116,
        粮草不足 = 117,
        木材不足 = 118,
        铁矿不足 = 119,
        材料不足 = 120,
        道具不足 = 121,
        个人贡献不足 = 122,
        活跃度状态不足 = 123,
        合成材料不足 = 124,
        挑战次数不足 = 125,
        势力资金不足 = 126,
        武神积分不足 = 127,
        出征令不足 = 128,
        制作材料不足 = 129,
        声望不足 = 130,
        体力已满 = 180,
        出征令已满 = 181,
        仓库粮食已满 = 182,
        仓库木头已满 = 183,
        仓库铁矿已满 = 184,
        拥有装备数量已满 = 185,
        拥有武将数量已满 = 186,
        不可卖店 = 200,
        不可交易 = 201,
        不可使用 = 202,
        不可批量使用 = 203,
        职位不符 = 204,
        CD未冷却 = 205,
        CD已冷却 = 206,
        验证错误战斗识别码 = 220,
        验证错误战斗结果 = 221,
        关卡尚未开启 = 250,
        每日关卡次数不足 = 251,
        已通过此关卡 = 252,
        事件状态不匹配 = 253,
        每日重置次数超限 = 254,
        军务积分不足 = 255,
        重置材料不足 = 256,
        没有这封邮件 = 257,
        没有附件 = 258,
        附件已领取过 = 259,
        错误的邮件类型 = 260,
        只有刺史以上职位才能发送郡邮件 = 261,
        只有知府以上职位才能发送府邮件 = 262,
        错误的郡对象 = 263,
        错误的府对象 = 264,
        不能给自己发邮件 = 265,
        聊天发送太快 = 280,
        聊天频道错误 = 281,
        商城ID错误 = 300,
        快捷购买ID错误 = 301,
        已经卖完 = 302,
        建筑升级队列已满 = 303,
        建筑升级已满级 = 304,
        建筑升级材料不足 = 305,
        建筑不在建造中 = 306,
        封地建筑需求玩家等级不足 = 307,
        府衙等级不足 = 308,
        计策ID错误 = 340,
        计策学习中 = 341,
        计策不在学习中 = 342,
        你已经拥有当前武将栏位数量 = 343,
        你尚未购买前级武将栏位数量 = 344,
        正在募兵中 = 380,
        不在募兵中 = 381,
        募兵已经完成 = 382,
        募兵数量过少 = 383,
        募兵数量过多 = 384,
        错误的武将ID = 400,
        武将锁定中 = 401,
        武将上阵中 = 402,
        武将募兵中 = 403,
        武将出征中 = 404,
        武将进行军务中 = 405,
        武将兵力不满 = 406,
        武将身上有装备 = 407,
        武将昵称过短 = 408,
        武将昵称过长 = 409,
        上阵武将过多 = 410,
        武将经验已满 = 411,
        武将攻击已满 = 412,
        武将防御已满 = 413,
        武将攻城已满 = 414,
        武将谋略已满 = 415,
        合成武将源不足 = 416,
        武将技能学习失败 = 417,
        相同精英级别才能合成 = 418,
        武将兑换活动已过期 = 419,
        兑换材料不足 = 420,
        没有可募兵的武将 = 421,
        武将数量已达到最大值 = 422,
        神将无法合成 = 423,
        武将资质已满 = 424,
        武将无法进化 = 425,
        武将进阶需要更高星级 = 426,
        星级已满 = 427,
        材料武将ID错误 = 428,
        武将星级错误 = 429,
        武将等级达到当前星级的等级上限 = 430,
        武将正在驻守资源点 = 431,
        武将重复布阵 = 432,
        布阵位置错误 = 433,
        布阵类型错误 = 434,
        前锋阵容超过上限 = 435,
        援军阵容超过上限 = 436,
        阵容编号错误 = 437,
        材料武将不能上阵 = 438,
        武将配置ID未找到 = 439,
        任务尚未完成 = 500,
        任务奖励已领取 = 501,
        每日任务尚未完成 = 502,
        每日任务奖励已领取 = 503,
        每日任务活跃度奖励已领完 = 504,
        错误的交易类型 = 700,
        错误的交易方式 = 701,
        错误的单号 = 702,
        挂单数量太大 = 703,
        挂单数量太小 = 704,
        挂单数量必须为_0_的倍数 = 705,
        单价不能低于_0_ = 706,
        单价不能高于_0_ = 707,
        交易数量太小 = 708,
        交易数量超过单子数量 = 709,
        交易数量必须为_0_的倍数 = 710,
        只能撤销自己的单子 = 711,
        不能买卖自己的交易单 = 712,
        交易单子太多 = 713,
        已经学会此技能 = 800,
        错误的技能ID = 801,
        技能槽位未解锁 = 802,
        技能已装备了 = 803,
        技能升级已满级 = 804,
        技能装备类型错误 = 805,
        错误的装备ID = 830,
        主角只能装备主角类装备 = 831,
        武将只能装备武将类装备 = 832,
        这个位置没有装备 = 833,
        只有特定职业的武将才能装备 = 834,
        只有特定的武将才能装备 = 835,
        交易对象错误 = 860,
        错误的交易单号 = 861,
        交易单子已经交易 = 862,
        不是你出售的物品 = 863,
        不能买入自己出售的物品 = 864,
        交易上架数目太大 = 865,
        出售价格太低 = 866,
        交易所需服务费不足 = 867,
        交易买入所需元宝不足 = 868,
        出售单子太多 = 869,
        装备名称过短 = 870,
        装备名称过长 = 871,
        购买次数上限 = 872,
        强化上限 = 873,
        赛季结束 = 874,
        不可升级 = 875,
        解锁条件不足 = 876,
        宝库活动未开启 = 900,
        未参与攻打宝库活动 = 901,
        您所在的势力还未报名参加活动 = 902,
        玩家报名无法找到战区ID = 903,
        玩家身份不满足 = 904,
        你已经报过名了 = 905,
        战斗验证不匹配 = 906,
        战斗生命值错误 = 907,
        没有到战区开启时间 = 908,
        没有到战区报名时间 = 909,
        据点已经被攻破 = 910,
        战区已经关闭 = 911,
        据点没有解锁 = 912,
        战区排名前三的势力才能挑战 = 913,
        不在报名时间内 = 914,
        剿匪活动已关闭 = 915,
        武神令牌不足 = 950,
        武神令牌已满 = 951,
        古塔未解锁 = 952,
        古塔已通过 = 953,
        古塔未通过 = 954,
        古塔已领取 = 955,
        活动奖励条件未达成 = 956,
        活动奖励已领取 = 957,
        活动奖励已兑换次数已完 = 958,
        活动奖励已兑换道具不足 = 959,
        您已经领取了该奖励 = 960,
        您没有可以领取的奖励 = 961,
        该奖励不可领取 = 962,
        兑换码不存在 = 963,
        兑换码已过期 = 964,
        兑换码已经被使用过了 = 965,
        兑换码同类型已达到使用个数上限 = 966,
        武将被俘中 = 967,
        您的部队已经成为雇佣兵暂时无法进行该操作 = 968,
        错误的雇佣号 = 969,
        不能雇佣自己 = 970,
        玩家不在队列中 = 971,
        装备已被分解 = 972,
        武将已被流放 = 973,
        七日登录奖励不可领取 = 974,
        七日登录奖励已领取 = 975,
        红包已失效 = 1000,
        已经抢过该红包 = 1001,
        该红包已抢完 = 1002,
        今日发红包达到上限 = 1003,
        今日领红包达到上限 = 1004,
        活动未开启 = 1005,
        活动已结束 = 1006,
        未达到活动开启等级 = 1007,
        奖励ID未找到 = 1008,
        幸运值不够 = 1009,
        开启次数不足 = 1010,
        今天已签到 = 1011,
        今天未签到 = 1012,
        已经没有补签次数 = 1013,
        刷新次数达到上限 = 1014,
        未知的货币类型 = 1015,
        觉醒类型错误 = 1016,
        觉醒需要更高星级 = 1017,
        觉醒已达到最大等级 = 1018,
        觉醒已达到最大星级 = 1019,
        觉醒条件不足 = 1020,
        星月会员正在开通状态 = 1021,
        今日星月会员奖励已领取 = 1022,
        今日星季会员奖励已领取 = 1023,
        不需要合成 = 1100,
        条件未达到 = 1101,
        奖励已领取 = 1102,
        挑战已经结束 = 1103,
        购买数量已达上限 = 1104,
        即时对战 = 1200,
        尚未加入对战 = 1201,
        势力 = 1400,
        你已加入势力了 = 1401,
        你尚未加入势力 = 1402,
        势力诸侯不能脱离势力 = 1403,
        对方不是势力成员 = 1404,
        势力人数已满 = 1405,
        势力加入申请通过 = 1406,
        只有诸侯才有权限 = 1407,
        只有诸侯或太守才有权限 = 1408,
        只有诸侯和太守才能同意申请 = 1409,
        对方不在申请列表 = 1410,
        势力不存在 = 1411,
        您刚退出势力不久不能加入新势力 = 1412,
        势力捐献ID错误 = 1413,
        对象势力已经是同盟了 = 1414,
        对象势力不是同盟 = 1415,
        你的势力没有占领这个城池 = 1416,
        对方已经是这个城的太守了 = 1417,
        你已经是这个城的太守了 = 1418,
        您不能逐出自己 = 1419,
        势力捐献次数已满 = 1420,
        势力收入不足 = 1421,
        圣女所属玩家ID未找到 = 1450,
        对方没有圣女资格 = 1451,
        势力没有圣女 = 1452,
        圣女被俘之中 = 1453,
        圣女捐献ID错误 = 1454,
        圣女今日捐献次数已满 = 1455,
        圣女已达到最高等级 = 1456,
        圣女已经被释放 = 1457,
        圣女赎回ID错误 = 1458,
        圣女今日赎回次数已满 = 1459,
        圣女已经驻守该城 = 1460,
        圣女卫队未完全复活 = 1461,
        城池 = 1500,
        城池ID错误 = 1501,
        守备营ID错误 = 1502,
        守备部队ID错误 = 1503,
        城池建筑升级条件不足 = 1520,
        城墙不需要修复 = 1521,
        城墙燃烧中无法修复 = 1522,
        器械建造过多 = 1523,
        城池战略 = 1600,
        只能防守己方城池 = 1601,
        城墙已经被攻破 = 1602,
        只能进攻相邻的敌方城池 = 1603,
        敌方城池在攻击保护期内 = 1604,
        尚未攻破任意城墙无法攻击内城 = 1605,
        不能进攻郡城 = 1606,
        不能防守郡城 = 1607,
        此城池不是郡城 = 1608,
        郡城攻打尚未开放 = 1609,
        只能匹配战斗郡城 = 1610,
        已经申请过好友 = 1700,
        对方已经是好友 = 1701,
        好友数量达到上限 = 1702,
        今日体力领取达到上限 = 1703,
        已领取过对方赠送的体力 = 1704,
        州ID错误 = 1750,
        资源点ID错误 = 1751,
        资源类型错误 = 1752,
        不能挑战自己的资源点 = 1753,
        上阵武将已经在其他资源采集队伍中 = 1754,
        您的进攻部队已达到上限 = 1755,
        无法进入不属于您的势力范围 = 1756,
        匪寇已经死亡 = 1757,
        征讨匪寇挑战次数不足 = 1758,
    };

    [Desc("排序方式")]
    public enum EOrder
    {
        [Desc("升序")]
        Ascending = 0,
        [Desc("降序")]
        Descending = 1,
    };

    [Desc("处理方式")]
    public enum EHandleAction
    {
        同意 = 0,
        拒绝 = 1,
        同意全部 = 2,
    };

    [Desc("语言")]
    public enum ELanguage
    {
        [Desc("中文")]
        Chinese = 0,
        [Desc("英文")]
        English = 1,
    };

    [Desc("战斗结果 胜负")]
    public enum EBattleResult
    {
        失败 = 0,
        胜利 = 1,
    };

    [Desc("动态日志类型")]
    public enum EGameLogType
    {
        加入势力 = 1,
        脱离势力 = 2,
        被踢出势力 = 3,
        任命太守 = 4,
        撤销太守 = 5,
        势力捐献 = 6,
        [Desc("攻击者名称 对象城池ID")]
        正在进攻 = 20,
        [Desc("攻击者名称 对象城池ID")]
        正在被进攻 = 21,
        [Desc("攻击者名称 对象城池ID")]
        城池攻破 = 22,
        [Desc("攻击者名称 对象城池ID")]
        城池被攻破 = 23,
    };

    [Desc("日志类型")]
    public enum ERecordType
    {
        注册游戏 = 1,
        登录游戏 = 2,
        退出游戏 = 3,
        平台支付充值 = 4,
        管理员登陆 = 20,
        管理员修改玩家数据 = 21,
        主角获取经验 = 40,
        主角升级 = 41,
        封地建造升级建筑 = 60,
        封地建造升级建筑道具加速 = 61,
        封地建造升级建筑立即完成 = 62,
        城池建造升级建筑 = 80,
        玩家改名 = 100,
        发送邮件 = 110,
        领取任务奖励 = 120,
        道具卖店 = 200,
        使用道具 = 201,
        合成道具 = 202,
        装备分解 = 220,
        工坊制造装备 = 221,
        工坊强化装备 = 222,
        武将合成 = 240,
        武将流放 = 241,
        武将技能学习 = 242,
        武将培养 = 243,
        武将升级 = 244,
        武将获取经验 = 245,
        募兵 = 260,
        募兵加速 = 261,
        募兵完成 = 262,
        商城购买商品 = 300,
        商城快捷购买 = 301,
        势力商店购买 = 302,
        商城购买武将背包上限 = 303,
        兑换码使用 = 304,
        购买体力 = 305,
        购买古塔令牌 = 306,
        交易所交易资源 = 320,
        交易所被交易资源 = 321,
        交易所退回单子 = 322,
        商会上架道具 = 340,
        商会上架装备 = 341,
        商会上架武将 = 342,
        商会购买道具 = 343,
        商会购买装备 = 344,
        商会购买武将 = 345,
        商会被购买道具 = 346,
        商会被购买装备 = 347,
        商会被购买武将 = 348,
        商会系统自动收购 = 360,
        商会系统自动收购到时回收 = 361,
        商会购买系统自动道具 = 362,
        商会购买系统自动装备 = 363,
        商会购买系统自动武将 = 364,
        玩家参加竞技场 = 400,
        玩家竞技场被攻击 = 401,
        玩家竞技场购买次数 = 402,
        竞技场周排名 = 403,
        挑战校场 = 420,
        进行军务 = 440,
        完成军务 = 441,
        军务挑战BOSS = 442,
        挑战主线副本 = 460,
        主线副本领取星级奖励 = 461,
        古塔挑战 = 480,
        古塔战斗记录 = 481,
        宝库攻打据点 = 500,
        宝库据点攻破 = 501,
        征讨匪寇 = 520,
        征讨匪寇刷新 = 521,
        元宝产出记录 = 900,
        金币产出记录 = 901,
        银两产出记录 = 902,
        木材产出记录 = 903,
        铁矿产出记录 = 904,
        粮草产出记录 = 905,
        装备产出记录 = 906,
        武将产出记录 = 907,
        道具产出记录 = 908,
        体力产出记录 = 909,
        挑战令牌产出记录 = 910,
        军牌产出记录 = 911,
        个人贡献产出记录 = 912,
        古塔积分产出记录 = 913,
        声望产出记录 = 914,
        活跃度产出记录 = 915,
        功勋产出记录 = 916,
        元宝消耗记录 = 950,
        金币消耗记录 = 951,
        银两消耗记录 = 952,
        木材消耗记录 = 953,
        铁矿消耗记录 = 954,
        粮草消耗记录 = 955,
        装备消耗记录 = 956,
        武将消耗记录 = 957,
        道具消耗记录 = 958,
        体力消耗记录 = 959,
        挑战令牌消耗记录 = 960,
        军牌消耗记录 = 961,
        个人贡献消耗记录 = 962,
        古塔积分消耗记录 = 963,
        声望消耗记录 = 964,
        活跃度消耗记录 = 965,
        功勋消耗记录 = 966,
    };

    [Desc("操作来源")]
    public enum EActionSource
    {
        系统 = 0,
        自动恢复 = 1,
        GM = 10,
        客户端调试 = 11,
        邮件 = 20,
        主角 = 30,
        道具 = 31,
        武将 = 32,
        装备 = 33,
        技能 = 34,
        武将升级 = 35,
        封地 = 40,
        匠工坊 = 41,
        城池 = 50,
        城池建筑 = 51,
        要塞升级 = 52,
        募兵 = 55,
        天赋 = 56,
        兵法 = 57,
        书院 = 58,
        任务 = 59,
        校场 = 60,
        军务 = 61,
        剧情 = 62,
        古塔 = 63,
        竞技场 = 64,
        交易所 = 70,
        商会 = 71,
        商城 = 72,
        商城快捷购买 = 73,
        金币兑换 = 74,
        玩家改名 = 80,
        府改名 = 81,
        活动兑换 = 82,
        活动奖励 = 83,
        兑换码 = 84,
        七日试炼 = 85,
        七日登录 = 86,
        福利系统 = 87,
        雇佣 = 88,
        发红包 = 89,
        抢红包 = 90,
        幸运抽奖 = 91,
        幸运奖励 = 92,
        支付宝充值 = 93,
        宝库 = 94,
        签到 = 95,
        钻石商店刷新 = 96,
        心法升级 = 97,
        心法升星 = 98,
        心法材料合成 = 99,
        VIP礼包 = 100,
        星月会员 = 101,
        红包返还 = 102,
        府战购买侦查次数 = 160,
        府战斥候刷新 = 161,
        斥候派遣中不能刷新 = 162,
        宴会厅抽奖 = 200,
        宴会厅奖励 = 201,
        势力创建 = 220,
        势力改名 = 221,
        势力捐献 = 222,
        势力商店 = 223,
        势力圣女捐献 = 224,
        势力圣女赎回 = 225,
        城墙修复 = 240,
        城墙器械建造 = 241,
        好友赠送 = 250,
        资源点挑战次数购买 = 251,
        征讨匪寇 = 252,
        征讨匪寇次数购买 = 253,
        征讨匪寇刷新 = 254,
        攻城 = 255,
        首次攻占城池 = 260,
    };

    [Desc("枚举示例")]
    public enum EnumBaseDemo
    {
        demo0 = 1,
        demo1 = 2,
    };

    [Desc("调试指令")]
    public enum EDebugCmd
    {
        [Desc("参数1=等级")]
        主角等级 = 1,
        主角军职 = 2,
        主角技能 = 3,
        主角天赋 = 4,
        主角装备 = 5,
        [Desc("参数1=ID 参数2=等级")]
        武将等级 = 6,
        精英武将 = 7,
        满资质 = 8,
        满忠诚 = 9,
        武将装备 = 10,
        补兵 = 11,
        元宝 = 12,
        金币 = 13,
        资源 = 14,
        [Desc("参数1=配置ID 参数2=数量")]
        获得物品 = 15,
        [Desc("参数1=配置ID")]
        获得装备 = 16,
        获得武将 = 17,
        封地建筑全满 = 18,
        封地建筑无CD = 19,
        封地建筑无消耗 = 20,
        府城建筑全满 = 21,
        府城建筑无CD = 22,
        府城建筑无消耗 = 23,
        地图秒杀 = 24,
        技能无CD = 25,
        受伤调整 = 26,
        伤害调整 = 27,
        功能开启 = 28,
        日常任务完成 = 29,
        主线任务完成 = 30,
        提升官职 = 31,
        更改所属府 = 32,
        军牌 = 33,
    };

    [Desc("更新方式")]
    public enum EInfoUpdateMode
    {
        [Desc("添加")]
        Add = 1,
        [Desc("删除")]
        Remove = 2,
        [Desc("刷新")]
        Update = 3,
    };

    [Desc("走马灯类型")]
    public enum ENoticeRollingType
    {
        玩家走马灯 = 0,
        临时走马灯 = 1,
        公告走马灯 = 2,
    };

    [Desc("邮件类型")]
    public enum EMailType
    {
        系统邮件 = 0,
        普通邮件 = 1,
        势力邮件 = 2,
    };

    [Desc("聊天频道")]
    public enum EChatChannel
    {
        世界 = 0,
        势力 = 1,
        私聊 = 2,
    };

    [Desc("城池归属")]
    public enum EOwnership
    {
        其他 = 0,
        我方 = 1,
        同盟 = 2,
    };

    [Desc("装备强化结果")]
    public enum EIntensifyResult
    {
        成功 = 0,
        强化等级不发生变化 = 1,
        强化等级减1 = 2,
        装备碎裂 = 3,
    };

    [Desc("兵营募兵状态")]
    public enum ERecruitStatus
    {
        不在募兵 = 0,
        募兵中 = 1,
        募兵完成 = 2,
    };

    [Desc("加速类型")]
    public enum ESpeedup
    {
        建筑 = 0,
        募兵 = 1,
        兵法 = 2,
    };

    [Desc("城墙器械类型")]
    public enum EWallWorkType
    {
        滚木 = 0,
        拒马 = 1,
        陷阱 = 2,
    };

    [Desc("交易方式")]
    public enum EDesignMode
    {
        [Desc("挂单买")]
        ShelvesBuy = 1,
        [Desc("交易卖")]
        TransactionSell = 1,
        [Desc("挂单卖")]
        ShelvesSell = 2,
        [Desc("交易买")]
        TransactionBuy = 2,
    };

    [Desc("是否包含自己的单子")]
    public enum EDesignFlag
    {
        [Desc("自己")]
        Self = 0,
        [Desc("其余")]
        Other = 1,
    };

    [Desc("是否包含自己的单子")]
    public enum EAuctionFlag
    {
        [Desc("自己")]
        Self = 0,
        [Desc("其余")]
        Other = 1,
    };

    [Desc("商会交易记录类型")]
    public enum EAuctionLogType
    {
        [Desc("卖")]
        Sell = 0,
        [Desc("买")]
        Buy = 1,
    };

    [Desc("商会交易记录类型")]
    public enum EAuctionLogItemType
    {
        [Desc("道具")]
        Item = 0,
        [Desc("装备")]
        Equip = 1,
        [Desc("武将")]
        Warrior = 2,
    };

    [Desc("活跃度状态")]
    public enum EDrawType
    {
        元宝十次 = 1,
        元宝一次 = 2,
        道具十次 = 3,
        道具一次 = 4,
    };

    [Desc("排行榜单条信息")]
    public enum ETopEquipType
    {
        admin_rank_RoleLevel = 1,
        admin_rank_RoleGrade = 2,
        admin_rank_WarriorLevel = 3,
        admin_rank_WarriorGrade = 4,
        admin_rank_type1 = 5,
        admin_rank_type2 = 6,
        admin_rank_type3 = 7,
        admin_rank_type4 = 8,
        admin_rank_type5 = 9,
        admin_rank_type6 = 10,
        admin_rank_type11 = 11,
        admin_rank_type12 = 12,
        admin_rank_type13 = 13,
        admin_rank_type14 = 14,
    };

    [Desc("任务类型")]
    public enum ETaskType
    {
        主线任务 = 1,
        每日任务 = 2,
        势力任务 = 3,
    };

    [Desc("任务状态")]
    public enum ETaskState
    {
        未激活 = 0,
        等级不够 = 1,
        未完成条件 = 2,
        已完成条件 = 3,
        已领取奖励 = 4,
    };

    [Desc("七日登录状态")]
    public enum E7DayLoginState
    {
        已领取奖励 = 1,
        无法领取奖励 = 2,
        未领取奖励 = 3,
    };

    [Desc("福利状态")]
    public enum EWelfareState
    {
        未完成条件 = 1,
        已完成条件 = 2,
        已领取奖励 = 3,
    };

    [Desc("势力职位")]
    public enum EGuildOffice
    {
        平民 = 0,
        成员 = 1,
        太守 = 99,
        诸侯 = 100,
    };

    [Desc("势力加入方式")]
    public enum EGuildJoinMode
    {
        自由加入 = 0,
        审核加入 = 1,
    };

    [Desc("红包状态")]
    public enum ERedPacketState
    {
        可领取 = 1,
        已领取 = 2,
        已抢完 = 3,
    };

    [Desc("古塔状态")]
    public enum ETowerState
    {
        未解锁 = 0,
        已解锁 = 1,
        已完成 = 2,
    };

    [Desc("守军关卡状态")]
    public enum EBankDefend
    {
        未解锁 = 1,
        已解锁 = 2,
        已攻陷 = 3,
    };

    [Desc("军务状态")]
    public enum EAffairsState
    {
        未激活 = 0,
        进行中 = 1,
        已完成 = 2,
        已领奖 = 3,
    };

    [Desc("战略状态")]
    public enum EStrategyStatus
    {
        待命 = 0,
        防守队列中 = 1,
        进攻队列中 = 2,
        郡城匹配队列中 = 3,
    };

    [Desc("大城池PVP综合状态")]
    public enum EMetroPvpState
    {
        未开放 = 0,
        开放中 = 1,
    };

    [Desc("大城池状态")]
    public enum EMetroCityStatus
    {
        未开放 = 0,
        开放中 = 1,
        被占领 = 2,
    };

    [Desc("玩家状态")]
    public enum EStatusBp
    {
        未知 = 1,
        等待准备 = 2,
        准备完成 = 3,
    };

    [Desc("战场状态")]
    public enum EStatusBf
    {
        未知 = 1,
        等待准备 = 2,
        准备完成 = 3,
    };

    [Desc("战场类型")]
    public enum EBattleType
    {
        城池攻打 = 0,
        郡城战斗 = 1,
    };


}

